tap "nikitabobko/tap"

# Shell & CLI (the dotfiles depend on these)
brew "docker-compose" # compose provider for `podman compose`
brew "eza"
brew "fd"
brew "forgejo-cli"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "jq"
brew "mise"
brew "neovim"
brew "podman"
brew "ripgrep"
brew "tmux"
brew "tree-sitter-cli"
brew "yq"

# Dev & infra tools — ambient defaults; projects pin exact versions via mise
brew "actionlint"
brew "argocd"
brew "betterleaks"
brew "cilium-cli"
brew "go" # per-project versions handled natively via go.mod's toolchain directive
brew "gofumpt"
brew "goimports"
brew "golangci-lint"
brew "hadolint"
brew "helm"
brew "istioctl"
brew "kubernetes-cli"
brew "opentofu"
brew "rustup" # keg-only; PATH handled in zsh/.zprofile — run `rustup default stable` once
brew "shellcheck"
brew "shfmt"
brew "trivy"
brew "uv"
brew "vacuum"
brew "yamlfmt"
brew "yamllint"

# Apps
cask "nikitabobko/tap/aerospace"
cask "betterdisplay"
cask "bruno"
cask "dbeaver-community"
cask "ghostty"
cask "karabiner-elements"
cask "pgadmin4"
cask "podman-desktop"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono"
