tap "nikitabobko/tap"

# Shell & CLI (the dotfiles depend on these)
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "tree-sitter-cli"

# Apps
cask "nikitabobko/tap/aerospace"
cask "betterdisplay"
cask "ghostty"
cask "karabiner-elements"

# Fonts
cask "font-jetbrains-mono"
